Autodesk.Revit.DB.LinearDimensionGeometryOptions.Create(Autodesk.Revit.DB.View,Autodesk.Revit.DB.DimensionType,System.Collections.Generic.IList{Autodesk.Revit.DB.Line},Autodesk.Revit.DB.Line)
Creates an instance of Autodesk.Revit.DB.LinearDimensionGeometryOptions with the specified parameters.
view:
The view whose properties will be used to compute the dimension geometry.
dimensionType:
The Autodesk.Revit.DB.DimensionType of the dimension.
dimensionReferences:
An array of reference lines to which the dimension is to be bound. You must supply at least two lines, and all lines supplied must be parallel to each other and perpendicular to the extension line.
extensionLine:
The extension line of the dimension.
Returns:
Returns an instance of Autodesk.Revit.DB.LinearDimensionGeometryOptions with the specified parameters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Invalid number of references.
-or-
The provided reference lines are not parallel.
-or-
The provided reference lines are not perpendicullar to the extension line.

Autodesk.Revit.DB.LinearDimensionGeometryOptions
A class that encapsulates the options needed to create the Linear Dimension geometry.